#### Terraform Plan - `infra/github`

<details>
<summary>Show Plan</summary>

```hcl
2026-01-30T03:21:07.979Z [INFO]  Terraform version: 1.10.5
2026-01-30T03:21:07.979Z [INFO]  Go runtime version: go1.23.3
2026-01-30T03:21:07.979Z [INFO]  CLI args: []string{"/home/runner/work/_temp/29344695-e5d8-4c19-9a9c-98e35aecbbd5/terraform-bin", "plan", "-no-color", "-input=false"}
2026-01-30T03:21:07.980Z [INFO]  CLI command args: []string{"plan", "-no-color", "-input=false"}
2026-01-30T03:21:08.000Z [INFO]  backend/local: starting Plan operation
2026-01-30T03:21:08.001Z [INFO]  provider: configuring client automatic mTLS
2026-01-30T03:21:08.020Z [INFO]  provider.terraform-provider-github_v6.10.2: configuring server automatic mTLS: timestamp=2026-01-30T03:21:08.019Z
2026-01-30T03:21:08.065Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/integrations/github/6.10.2/linux_amd64/terraform-provider-github_v6.10.2 id=2244
2026-01-30T03:21:08.067Z [INFO]  provider: configuring client automatic mTLS
2026-01-30T03:21:08.081Z [INFO]  provider.terraform-provider-github_v6.10.2: configuring server automatic mTLS: timestamp=2026-01-30T03:21:08.080Z
2026-01-30T03:21:08.115Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/integrations/github/6.10.2/linux_amd64/terraform-provider-github_v6.10.2 id=2253
2026-01-30T03:21:08.115Z [INFO]  backend/local: plan calling Plan
2026-01-30T03:21:08.117Z [INFO]  provider: configuring client automatic mTLS
2026-01-30T03:21:08.127Z [INFO]  provider.terraform-provider-github_v6.10.2: configuring server automatic mTLS: timestamp=2026-01-30T03:21:08.127Z
2026-01-30T03:21:08.153Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/integrations/github\"]" changed the config value, but that value is unused
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [INFO] Selecting owner  from GITHUB_OWNER environment variable: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [INFO] Setting write_delay_ms to 1000: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [DEBUG] Setting read_delay_ms to 0: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [DEBUG] Setting retry_delay_ms to 0: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [DEBUG] Setting max_retries to 3: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [DEBUG] Setting retriableErrors to map[500:true 502:true 503:true 504:true]: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [DEBUG] Setting max_per_page to 100: timestamp=2026-01-30T03:21:08.154Z
2026-01-30T03:21:08.154Z [INFO]  provider.terraform-provider-github_v6.10.2: 2026/01/30 03:21:08 [DEBUG] Setting parallel_requests to false: timestamp=2026-01-30T03:21:08.154Z
data.github_repository.cc_audit: Reading...
2026-01-30T03:21:08.361Z [WARN]  Provider "registry.terraform.io/integrations/github" produced an invalid plan for github_repository_ruleset.protect_release_tags, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .rules[0].update_allows_fetch_and_merge: planned value cty.False for a non-computed attribute
2026-01-30T03:21:08.365Z [WARN]  Provider "registry.terraform.io/integrations/github" produced an invalid plan for github_repository_ruleset.protect_main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .rules[0].update_allows_fetch_and_merge: planned value cty.False for a non-computed attribute
      - .rules[0].pull_request[0].dismiss_stale_reviews_on_push: planned value cty.False for a non-computed attribute
      - .rules[0].pull_request[0].require_code_owner_review: planned value cty.False for a non-computed attribute
      - .rules[0].pull_request[0].require_last_push_approval: planned value cty.False for a non-computed attribute
      - .rules[0].pull_request[0].required_approving_review_count: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .rules[0].required_status_checks[0].do_not_enforce_on_create: planned value cty.False for a non-computed attribute
data.github_repository.cc_audit: Read complete after 1s [id=cc-audit]
2026-01-30T03:21:08.934Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/integrations/github/6.10.2/linux_amd64/terraform-provider-github_v6.10.2 id=2262
2026-01-30T03:21:08.936Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_ruleset.protect_main will be created
  + resource "github_repository_ruleset" "protect_main" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "cc-audit"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + non_fast_forward              = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = true
            }

          + required_status_checks {
              + do_not_enforce_on_create             = false
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "CI Result"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "MSRV Result"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "Performance Result"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "Security Result"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "Self Audit Result"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "Semver Result"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "Terraform Result"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.protect_release_tags will be created
  + resource "github_repository_ruleset" "protect_release_tags" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-release-tags"
      + node_id     = (known after apply)
      + repository  = "cc-audit"
      + ruleset_id  = (known after apply)
      + target      = "tag"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/tags/v*",
                ]
            }
        }

      + rules {
          + deletion                      = true
          + update                        = true
          + update_allows_fetch_and_merge = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + branch_ruleset_name    = "protect-main-branch"
  + repository_name        = "cc-audit"
  + required_status_checks = [
      + "CI Result",
      + "Security Result",
      + "Self Audit Result",
      + "MSRV Result",
      + "Performance Result",
      + "Semver Result",
      + "Terraform Result",
    ]
  + tag_ruleset_name       = "protect-release-tags"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ryo-ebata, Action: `pull_request`*